run/OFW2025/case3/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}
#include "$FOAM_CASE/caseInfo"

application biotFoam;

startFrom startTime;

startTime $startTime;

stopAt endTime;

endTime $endTime;

deltaT $deltaT;

writeControl adjustableRunTime;

writeInterval $writeInterval;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression uncompressed;

timeFormat general;

timePrecision 6;

graphFormat raw;

runTimeModifiable yes;

libs ( "libliqueFvPatchFields.so" "libLiquefactionFvMeshFields.so" "libcontactModels.so"  "libsolidModels.so" );

#include "Functions.H"
