run/OFW2025/case3/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

#include "$FOAM_CASE/caseInfo"

vertices
(
    ($x1 0  $z2) //0
    ($x2 0  $z2) //1
    ($x2 $y $z2) //2
    ($x1 $y $z2) //3
    ($x1 0  $z1) //4
    ($x2 0  $z1) //5
    ($x2 $y $z1) //6
    ($x1 $y $z1) //7
    ($x3 0  $z2) //8
    ($x3 $y $z2) //9
    ($x4 0  $z2) //10
    ($x4 $y $z2) //11  
    ($x3 0  $z1) //12
    ($x3 $y $z1) //13
    ($x4 0  $z1) //14
    ($x4 $y $z1) //15
    
    ($x3 0  $z3)//16
    ($x3 $y $z3)//17
    ($x4 0  $z3)//18
    ($x4 $y $z3)//19
    ($x1 0  $z3)//20
    ($x1 $y $z3)//21
    ($x2 0  $z3)//22
    ($x2 $y $z3)//23

    ($x3 0  $z1)//24
    ($x3 $y $z1)//25
    ($x4 0  $z1)//26
    ($x4 $y $z1)//27
    ($x3 0  $z4)//28
    ($x3 $y $z4)//29
    ($x4 0  $z4)//30
    ($x4 $y $z4)//31
    
    ($x1 0  $z4)
    ($x1 $y $z4)
    ($x3 0  $z4)
    ($x3 $y $z4)
    ($x4 0  $z4)
    ($x4 $y $z4)
    ($x2 0  $z4)
    ($x2 $y $z4)
);

blocks
(
    hex (0 8 9 3 20 16 17 21) ($nxs 1 $nzb) simpleGrading (1 1 1)
    hex (20 16 17 21 4 12 13 7) ($nxs 1 $nzt) simpleGrading (1 1 1)
    hex (8 10 11 9 16 18 19 17) ($nxf 1 $nzb) simpleGrading (1 1 1)
    hex (16 18 19 17 12 14 15 13) ($nxf 1 $nzt) simpleGrading (1 1 1)
    hex (10 1 2 11 18 22 23 19) ($nxs 1 $nzb) simpleGrading (1 1 1)
    hex (18 22 23 19 14 5 6 15) ($nxs 1 $nzt) simpleGrading (1 1 1)
    hex (24 26 27 25 28 30 31 29) ($nxf 1 $nzf) simpleGrading (1 1 1)
    //hex (4 12 13 7 32 34 35 33) ($nxs 1  $nzf)simpleGrading (1 1 1)
    //hex (14 5 6 15  36 38 39 37) ($nxs 1  $nzf)simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    seaBed
    {
        type wall;
        faces
        (
            //(32 34 35 33)
            (4 12 13 7)
            (28 30 31 29)
            (31 30 26 27)
            (24 28 29 25)
            (14 5 6 15)
            //(36 38 39 37)
        );
    }

    /*seabedFoundation
    {
        type splitCyclic;
        neighbourPatch  foundationSeabed;
        faces
        (
            (12 34 35 13)
            (12 14 15 13)
            (37 36 14 15)
        );
    }

    foundationSeabed
    {
        type splitCyclic;
        neighbourPatch  seabedFoundation;
        faces
        (
            (24 28 29 25)
            (24 26 27 25)
            (31 30 26 27)
        );
    }*/

    /*seabedFoundation1
    {
        type splitCyclic;
        neighbourPatch  foundationSeabed1;
        faces
        (
            (12 34 35 13)
            //(12 14 15 13)
            //(37 36 14 15)
        );
    }

    foundationSeabed1
    {
        type splitCyclic;
        neighbourPatch  seabedFoundation1;
        faces
        (
            (24 28 29 25)
            //(24 26 27 25)
            //(31 30 26 27)
        );
    }*/

    seabedFoundation
    {
        type splitCyclic;
        neighbourPatch  foundationSeabed;
        faces
        (
            //(12 34 35 13)
            (12 14 15 13)
            //(37 36 14 15)
        );
    }

    foundationSeabed
    {
        type splitCyclic;
        neighbourPatch  seabedFoundation;
        faces
        (
            //(24 28 29 25)
            (24 26 27 25)
            //(31 30 26 27)
        );
    }
    /*seabedFoundation3
    {
        type splitCyclic;
        neighbourPatch  foundationSeabed3;
        faces
        (
            //(12 34 35 13)
            //(12 14 15 13)
            (37 36 14 15)
        );
    }

    foundationSeabed3
    {
        type splitCyclic;
        neighbourPatch  seabedFoundation3;
        faces
        (
            //(24 28 29 25)
            //(24 26 27 25)
            (31 30 26 27)
        );
    }*/

    /*foundationTop
    {
        type wall;
        faces
        (
            (28 30 31 29)
            (31 30 26 27)
            (24 28 29 25)
        );
    }*/

    soilDomainBottom
    {
        type wall;
        faces
        (
            (0 8 9 3 )
            (10 1 2 11)
            (8 10 11 9)
        );
    }

    left
    {
        type    splitCyclic;
        neighbourPatch right;
        faces
        (
            (0 20 21 3)
            (20 4 7 21)
            //(4 32 33 7)
        );
    }
    
    right
    {
        type    splitCyclic;
        neighbourPatch left;
        faces
        (
            (1 22 23 2)
            (22 5 6 23)
            //(5 38 39 6)
        );
    }

    frontBack
    {
        type empty;
        faces
        (
            (0 8 16 20)
            (3 9 17 21)
            (20 16 12 4)
            (21 17 13 7)
            (8 10 18 16)
            (9 11 19 17)
            (16 18 14 12)
            (17 19 15 13)
            (10 1 22 18)
            (11 2 23 19)
            (18 22 5 14)
            (19 23 6 15)
            (24 28 30 26)
            (25 29 31 27)
            //(4 12 34 32)
            //(7 13 35 33)
            //(14 5 38 36)
            //(15 6 39 37)

        );
    }
    /*liq
    {
        type splitCyclic;
        neighbourPatch  sol;
        faces
        (
        );
    }
    sol
    {
        type splitCyclic;
        neighbourPatch  liq;
        faces
        (
        );
    }*/

);

mergePatchPairs
(
);

// ************************************************************************* //
