run/OFW2025/case3/constant/waveProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object waveProperties;
}
#include "$FOAM_CASE/caseInfo"

waveHeight $waveHeight;

waterDepth $waterDepth; 	// in m// in m

direction (1 0 0); 	//wave direction

period $period; 	//wave period

waveLength $waveLength; 	//wave length

phase 0.0; 	// Phase shift in rad/(2*pi)

offset 0; 	// base pressure

value uniform 0; 	// Initial value

start 0; 	
// ************************************************************************* //

