run/OFW2025/case3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    foundationSeabed
    {
        type            splitCyclic; 
        
    }

    seabedFoundation
    {
        type            splitCyclic;
    }
    /*"seabedFoundation1|seabedFoundation2|seabedFoundation3"
    {
        type            splitCyclic;
    }

    "foundationSeabed1|foundationSeabed2|foundationSeabed3"
    {
        type            splitCyclic;
    }*/

    seaBed
    {
        type            tractionDisplacementSF;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }

    foundationTop
    {
        type            tractionDisplacementSF;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }

    "left|right"
    {
        type            splitCyclic;
    }
    
    soilDomainBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontBack
    {
        type            empty;
    }
    /*liq
    {

        patchType       splitCyclic;
        type            cyclicFixedValue;
        value           uniform (0 0 0 );
        //type            splitCyclic;
    }

    sol
    {
        patchType       splitCyclic;
        type            tractionPressureDisplacementSF;
        traction        uniform (0 0 0);
        pressure        uniform 0;
        value           uniform (0 0 0);
    }*/

    liq
    {
        type            splitCyclic;
    }
    sol
    {
        type            splitCyclic;
    }
}

// ************************************************************************* //
