run/OFW2025/case3/0/sigma0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.2";
    object      sigma0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6240
(
1644.96
1644.96
1644.96
1644.96
1644.97
1644.97
1644.98
1644.98
...
)
;

boundaryField
{
    seaBed
    {
        type            zeroGradient;
    }
    seabedFoundation
    {
        type            splitCyclic;
    }
    foundationSeabed
    {
        type            splitCyclic;
    }
    soilDomainBottom
    {
        type            zeroGradient;
    }
    left
    {
        type            splitCyclic;
    }
    right
    {
        type            splitCyclic;
    }
    frontBack
    {
        type            empty;
    }
    liq
    {
        type            splitCyclic;
    }
    sol
    {
        type            splitCyclic;
    }
}


// ************************************************************************* //
