run/OFW2025/case3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    U
    {
        solver          PCG;
        preconditioner  DILU;        
        tolerance       1e-15;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         1;
 

    }

    Vm
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         1;
 

    }

    p
    {
        solver          PCG;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         1;
 
    }
    
    pE
    {
        solver          PCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        minIter         1;
 
    }
    
    rho
    {}

    alpha
    {
        solver          PBiCG;
        preconditioner  DILU;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        smoother        GaussSeidel;
        mergeLevels     1;
        tolerance        1e-07;
        relTol           0;
    }

}

stressAnalysis
{
    compactNormalStress yes;
    nCorrectors    3500;
    U               9e-04;
    aitkenRelaxation false;
    
}

PISO
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors     2;

}



relaxationFactors
{
    fields
    {
        //default -1;
        //U    0.001;
        //U    0.2;
        U    0.2;
        p     0.2;
    }
    equations
    {
        //default -1;
        //p     0.2;
        //D    1;
        Vm    0.8;
    }
}


// ************************************************************************* //
