run/OFW2025/case3/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

{
    name    anchorFaceSet;
    type    faceSet;
    action  new;
    source  boxToFace;
    sourceInfo
    {
        box (4.552 0 0)(6.6080 2.056 0.463);
    }
}

{
    name    anchorCellSet;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
        box (4.552 0 0)(6.6080 2.056 0.463);
    }
}

{
    name    anchorFaces;
    type    faceZoneSet;
    action  new;
    source  setsToFaceZone;
    sourceInfo
    {
        faceSet anchorFaceSet;
        cellSet anchorCellSet;
    }
}
    
{
    name    anchorZones;
    type    cellZoneSet;
    action  new;
    source  setToCellZone;
    sourceInfo
    {
        set anchorCellSet;
    }
}









=














);

// ************************************************************************* //
